const state = {
  trainers: [
    {
      imge: require('../../assets/img/trainer/woman/w-1.png'),
      type: 'عمومی',
      NameFamily: 'عاطفه فدایی',
      Biography:
        'و به عنوان سرمربی تیم بانوان هیروفیت می‌توانم شما ورزشکاران گرامی را در رسیدن به اهداف تمرینی و تناسب اندام خود یاری نمایم. بنده مربی درجه یک و بین‌المللی رسمی فدراسیون بدنسازی و مربی بین‌المللی زومبا و همچنین تی‌ارایکس و پیلاتس هستم.اینجانب ۱۳ سال سابقه تمرینی و آموزشی دارم و در این مدت ورزشکاران زیادی را به اهداف تناسب اندام خود رسانده‌ام. امروز این امکان در هیروفیت فراهم آماده است تا در خدمت شما باشم و به رویای جمع بزرگتری از شما ورزشکاران عزیز جامع عمل بپوشانم.',
      id: '0',
    },
    {
      imge: require('../../assets/img/trainer/woman/w-2.jpg'),
      type: 'خصوصی',
      NameFamily: 'لیلا محمدی',
      Biography:
        'و به عنوان سرمربی تیم بانوان هیروفیت می‌توانم شما ورزشکاران گرامی را در رسیدن به اهداف تمرینی و تناسب اندام خود یاری نمایم. بنده مربی درجه یک و بین‌المللی رسمی فدراسیون بدنسازی و مربی بین‌المللی زومبا و همچنین تی‌ارایکس و پیلاتس هستم.اینجانب ۱۳ سال سابقه تمرینی و آموزشی دارم و در این مدت ورزشکاران زیادی را به اهداف تناسب اندام خود رسانده‌ام. امروز این امکان در هیروفیت فراهم آماده است تا در خدمت شما باشم و به رویای جمع بزرگتری از شما ورزشکاران عزیز جامع عمل بپوشانم.',
      id: '1',
    },
    {
      imge: require('../../assets/img/trainer/woman/w-3.jpg'),
      type: 'عمومی',
      NameFamily: 'الیسا جعفری',
      Biography:
        'و به عنوان سرمربی تیم بانوان هیروفیت می‌توانم شما ورزشکاران گرامی را در رسیدن به اهداف تمرینی و تناسب اندام خود یاری نمایم. بنده مربی درجه یک و بین‌المللی رسمی فدراسیون بدنسازی و مربی بین‌المللی زومبا و همچنین تی‌ارایکس و پیلاتس هستم.اینجانب ۱۳ سال سابقه تمرینی و آموزشی دارم و در این مدت ورزشکاران زیادی را به اهداف تناسب اندام خود رسانده‌ام. امروز این امکان در هیروفیت فراهم آماده است تا در خدمت شما باشم و به رویای جمع بزرگتری از شما ورزشکاران عزیز جامع عمل بپوشانم.',
      id: '2',
    },
    {
      imge: require('../../assets/img/trainer/woman/w-4.jpg'),
      type: 'عمومی',
      NameFamily: 'مهسا سلطانی',
      Biography:
        'و به عنوان سرمربی تیم بانوان هیروفیت می‌توانم شما ورزشکاران گرامی را در رسیدن به اهداف تمرینی و تناسب اندام خود یاری نمایم. بنده مربی درجه یک و بین‌المللی رسمی فدراسیون بدنسازی و مربی بین‌المللی زومبا و همچنین تی‌ارایکس و پیلاتس هستم.اینجانب ۱۳ سال سابقه تمرینی و آموزشی دارم و در این مدت ورزشکاران زیادی را به اهداف تناسب اندام خود رسانده‌ام. امروز این امکان در هیروفیت فراهم آماده است تا در خدمت شما باشم و به رویای جمع بزرگتری از شما ورزشکاران عزیز جامع عمل بپوشانم.',
      id: '3',
    },
    {
      imge: require('../../assets/img/trainer/woman/w-5.jpg'),
      type: 'خصوصی',
      NameFamily: 'فاطمه ابراهیمی',
      Biography:
        'و به عنوان سرمربی تیم بانوان هیروفیت می‌توانم شما ورزشکاران گرامی را در رسیدن به اهداف تمرینی و تناسب اندام خود یاری نمایم. بنده مربی درجه یک و بین‌المللی رسمی فدراسیون بدنسازی و مربی بین‌المللی زومبا و همچنین تی‌ارایکس و پیلاتس هستم.اینجانب ۱۳ سال سابقه تمرینی و آموزشی دارم و در این مدت ورزشکاران زیادی را به اهداف تناسب اندام خود رسانده‌ام. امروز این امکان در هیروفیت فراهم آماده است تا در خدمت شما باشم و به رویای جمع بزرگتری از شما ورزشکاران عزیز جامع عمل بپوشانم.',
      id: '4',
    },
    {
      imge: require('../../assets/img/trainer/woman/w-6.jpg'),
      type: 'خصوصی',
      NameFamily: 'مریم حسینی',
      Biography:
        'و به عنوان سرمربی تیم بانوان هیروفیت می‌توانم شما ورزشکاران گرامی را در رسیدن به اهداف تمرینی و تناسب اندام خود یاری نمایم. بنده مربی درجه یک و بین‌المللی رسمی فدراسیون بدنسازی و مربی بین‌المللی زومبا و همچنین تی‌ارایکس و پیلاتس هستم.اینجانب ۱۳ سال سابقه تمرینی و آموزشی دارم و در این مدت ورزشکاران زیادی را به اهداف تناسب اندام خود رسانده‌ام. امروز این امکان در هیروفیت فراهم آماده است تا در خدمت شما باشم و به رویای جمع بزرگتری از شما ورزشکاران عزیز جامع عمل بپوشانم.',
      id: '5',
    },
    {
      imge: require('../../assets/img/trainer/man/m-1.jpg'),
      type: 'عمومی',
      NameFamily: 'علی شریفی',
      Biography:
        'و به عنوان سرمربی تیم بانوان هیروفیت می‌توانم شما ورزشکاران گرامی را در رسیدن به اهداف تمرینی و تناسب اندام خود یاری نمایم. بنده مربی درجه یک و بین‌المللی رسمی فدراسیون بدنسازی و مربی بین‌المللی زومبا و همچنین تی‌ارایکس و پیلاتس هستم.اینجانب ۱۳ سال سابقه تمرینی و آموزشی دارم و در این مدت ورزشکاران زیادی را به اهداف تناسب اندام خود رسانده‌ام. امروز این امکان در هیروفیت فراهم آماده است تا در خدمت شما باشم و به رویای جمع بزرگتری از شما ورزشکاران عزیز جامع عمل بپوشانم.',
      id: '6',
    },
    {
      imge: require('../../assets/img/trainer/man/m-2.jpg'),
      type: 'عمومی',
      NameFamily: 'حسین محمودی',
      Biography:
        'و به عنوان سرمربی تیم بانوان هیروفیت می‌توانم شما ورزشکاران گرامی را در رسیدن به اهداف تمرینی و تناسب اندام خود یاری نمایم. بنده مربی درجه یک و بین‌المللی رسمی فدراسیون بدنسازی و مربی بین‌المللی زومبا و همچنین تی‌ارایکس و پیلاتس هستم.اینجانب ۱۳ سال سابقه تمرینی و آموزشی دارم و در این مدت ورزشکاران زیادی را به اهداف تناسب اندام خود رسانده‌ام. امروز این امکان در هیروفیت فراهم آماده است تا در خدمت شما باشم و به رویای جمع بزرگتری از شما ورزشکاران عزیز جامع عمل بپوشانم.',
      id: '7',
    },
    {
      imge: require('../../assets/img/trainer/man/m-3.jpg'),
      type: 'عمومی',
      NameFamily: 'ماهان مهدوی',
      Biography:
        'و به عنوان سرمربی تیم بانوان هیروفیت می‌توانم شما ورزشکاران گرامی را در رسیدن به اهداف تمرینی و تناسب اندام خود یاری نمایم. بنده مربی درجه یک و بین‌المللی رسمی فدراسیون بدنسازی و مربی بین‌المللی زومبا و همچنین تی‌ارایکس و پیلاتس هستم.اینجانب ۱۳ سال سابقه تمرینی و آموزشی دارم و در این مدت ورزشکاران زیادی را به اهداف تناسب اندام خود رسانده‌ام. امروز این امکان در هیروفیت فراهم آماده است تا در خدمت شما باشم و به رویای جمع بزرگتری از شما ورزشکاران عزیز جامع عمل بپوشانم.',
      id: '8',
    },
    {
      imge: require('../../assets/img/trainer/man/m-4.jpg'),
      type: 'خصوصی',
      NameFamily: 'عادل احمدی',
      Biography:
        'و به عنوان سرمربی تیم بانوان هیروفیت می‌توانم شما ورزشکاران گرامی را در رسیدن به اهداف تمرینی و تناسب اندام خود یاری نمایم. بنده مربی درجه یک و بین‌المللی رسمی فدراسیون بدنسازی و مربی بین‌المللی زومبا و همچنین تی‌ارایکس و پیلاتس هستم.اینجانب ۱۳ سال سابقه تمرینی و آموزشی دارم و در این مدت ورزشکاران زیادی را به اهداف تناسب اندام خود رسانده‌ام. امروز این امکان در هیروفیت فراهم آماده است تا در خدمت شما باشم و به رویای جمع بزرگتری از شما ورزشکاران عزیز جامع عمل بپوشانم.',
      id: '9',
    },
    {
      imge: require('../../assets/img/trainer/man/m-5.png'),
      type: 'خصوصی',
      NameFamily: 'مهران صالحی',
      Biography:
        'و به عنوان سرمربی تیم بانوان هیروفیت می‌توانم شما ورزشکاران گرامی را در رسیدن به اهداف تمرینی و تناسب اندام خود یاری نمایم. بنده مربی درجه یک و بین‌المللی رسمی فدراسیون بدنسازی و مربی بین‌المللی زومبا و همچنین تی‌ارایکس و پیلاتس هستم.اینجانب ۱۳ سال سابقه تمرینی و آموزشی دارم و در این مدت ورزشکاران زیادی را به اهداف تناسب اندام خود رسانده‌ام. امروز این امکان در هیروفیت فراهم آماده است تا در خدمت شما باشم و به رویای جمع بزرگتری از شما ورزشکاران عزیز جامع عمل بپوشانم.',
      id: '10',
    },
    {
      imge: require('../../assets/img/trainer/man/m-6.jpg'),
      type: 'خصوصی',
      NameFamily: 'محمد ساسانی',
      Biography:
        'و به عنوان سرمربی تیم بانوان هیروفیت می‌توانم شما ورزشکاران گرامی را در رسیدن به اهداف تمرینی و تناسب اندام خود یاری نمایم. بنده مربی درجه یک و بین‌المللی رسمی فدراسیون بدنسازی و مربی بین‌المللی زومبا و همچنین تی‌ارایکس و پیلاتس هستم.اینجانب ۱۳ سال سابقه تمرینی و آموزشی دارم و در این مدت ورزشکاران زیادی را به اهداف تناسب اندام خود رسانده‌ام. امروز این امکان در هیروفیت فراهم آماده است تا در خدمت شما باشم و به رویای جمع بزرگتری از شما ورزشکاران عزیز جامع عمل بپوشانم.',
      id: '11',
    },
  ],
  days: [
    {
      time: '8.00am - 10.00am',
      type1: 'عمومی',
      NameFamily1: 'عاطفه فدایی',
      type2: 'خصوصی',
      NameFamily2: 'مریم حسینی',
      type3: 'عمومی',
      NameFamily3: 'الیسا جعفری',
      type4: 'خصوصی',
      NameFamily4: 'لیلا محمدی',
      type5: 'عمومی',
      NameFamily5: 'مهسا سلطانی',
      type6: 'خصوصی',
      NameFamily6: 'فاطمه ابراهیمی',
    },
    {
      time: '10.00am - 12.00am',
      type1: 'خصوصی',
      NameFamily1: 'لیلا محمدی',
      type2: 'عمومی',
      NameFamily2: 'حسین محمودی',
      type3: 'خصوصی',
      NameFamily3: 'فاطمه ابراهیمی',
      type4: 'عمومی',
      NameFamily4: 'عاطفه فدایی',
      type5: 'خصوصی',
      NameFamily5: 'مریم حسینی',
      type6: 'عمومی',
      NameFamily6: 'الیسا جعفری',
    },
    {
      time: '5.00pm - 7.00pm',
      type1: 'عمومی',
      NameFamily1: 'ماهان مهدوی',
      type2: 'خصوصی',
      NameFamily2: 'عادل احمدی',
      type3: 'عمومی',
      NameFamily3: 'علی شریفی',
      type4: 'خصوصی',
      NameFamily4: 'مهران صالحی',
      type5: 'عمومی',
      NameFamily5: 'حسین محمودی',
      type6: 'خصوصی',
      NameFamily6: 'محمد ساسانی',
    },
    {
      time: '7.00pm - 9.00pm',
      type1: 'خصوصی',
      NameFamily1: 'مهران صالحی',
      type2: 'عمومی',
      NameFamily2: 'ماهان مهدوری',
      type3: 'خصوصی',
      NameFamily3: 'محمد ساسانی',
      type4: 'عمومی',
      NameFamily4: 'علی شریفی',
      type5: 'خصوصی',
      NameFamily5: 'عادل احمدی',
      type6: 'عمومی',
      NameFamily6: 'حسین محمودی',
    },
  ],
  program: [
    {
      imge: require('../../assets/img/trainer/program/1.gif'),
      title: 'پرس سینه هالتر :  ۱۰ × ۳',
    },
    {
      imge: require('../../assets/img/trainer/program/2.gif'),
      title: 'پرس بالا سینه : ۱۰ × ۳',
    },
    {
      imge: require('../../assets/img/trainer/program/3.gif'),
      title: 'قفسه فلای : ۱۰ × ۳',
    },
    {
      imge: require('../../assets/img/trainer/program/4.gif'),
      title: 'سرشانه هالتر از جلو : ۱۰ × ۳',
    },
    {
      imge: require('../../assets/img/trainer/program/5.gif'),
      title: 'لت از جلو دست باز : ۱۰ × ۳',
    },
    {
      imge: require('../../assets/img/trainer/program/6.gif'),
      title: 'قایقی دستگاه : ۱۰ × ۳',
    },
    {
      imge: require('../../assets/img/trainer/program/7.gif'),
      title: 'جلو بازو هالتر : ۱۰ × ۳',
    },
    {
      imge: require('../../assets/img/trainer/program/8.gif'),
      title: 'جلو بازو سیم کش : ۱۰ × ۳',
    },
    {
      imge: require('../../assets/img/trainer/program/9.gif'),
      title: 'پشت بازو سیم کش : ۱۰ × ۳',
    },

    {
      imge: require('../../assets/img/trainer/program/10.gif'),
      title: 'جلو پا دستگاه : ۱۰ × ۳',
    },
    {
      imge: require('../../assets/img/trainer/program/11.gif'),
      title: 'پشت پا دستگاه : ۱۰ × ۳',
    },
    {
      imge: require('../../assets/img/trainer/program/12.gif'),
      title: 'ساق پا دستگاه : ۱۵ × ۳',
    },
    {
      imge: require('../../assets/img/trainer/program/13.gif'),
      title: 'شکم : ۱۵ × ۳',
    },
    {
      imge: require('../../assets/img/trainer/program/14.gif'),
      title: 'فیله کمر : ۱۵ × ۳',
    },
  ],
}

const getters = {
  GetTrainers(state) {
    return state.trainers
  },
  GetDays(state) {
    return state.days
  },
  GetProgram(state) {
    return state.program
  },
}
const mutations = {}
const actions = {}

export default {
  state,
  getters,
  mutations,
  actions,
}
