const state = {
  trainers: [
    {
      imge: 'https://s6.uupload.ir/files/w-1_4c4.png',
      type: 'عمومی',
      field: 'بدنسازی',
      NameFamily: 'عاطفه فدایی',
      Biography:
        'و به عنوان سرمربی تیم بانوان هیروفیت می‌توانم شما ورزشکاران گرامی را در رسیدن به اهداف تمرینی و تناسب اندام خود یاری نمایم. بنده مربی درجه یک و بین‌المللی رسمی فدراسیون بدنسازی و مربی بین‌المللی زومبا و همچنین تی‌ارایکس و پیلاتس هستم.اینجانب ۱۳ سال سابقه تمرینی و آموزشی دارم و در این مدت ورزشکاران زیادی را به اهداف تناسب اندام خود رسانده‌ام. امروز این امکان در هیروفیت فراهم آماده است تا در خدمت شما باشم و به رویای جمع بزرگتری از شما ورزشکاران عزیز جامع عمل بپوشانم.',
      id: '0',
    },
    {
      imge: 'https://s6.uupload.ir/files/w-22_qfr7.png',
      type: 'خصوصی',
      field: 'بدنسازی',
      NameFamily: 'لیلا محمدی',
      Biography:
        'و به عنوان سرمربی تیم بانوان هیروفیت می‌توانم شما ورزشکاران گرامی را در رسیدن به اهداف تمرینی و تناسب اندام خود یاری نمایم. بنده مربی درجه یک و بین‌المللی رسمی فدراسیون بدنسازی و مربی بین‌المللی زومبا و همچنین تی‌ارایکس و پیلاتس هستم.اینجانب ۱۳ سال سابقه تمرینی و آموزشی دارم و در این مدت ورزشکاران زیادی را به اهداف تناسب اندام خود رسانده‌ام. امروز این امکان در هیروفیت فراهم آماده است تا در خدمت شما باشم و به رویای جمع بزرگتری از شما ورزشکاران عزیز جامع عمل بپوشانم.',
      id: '1',
    },
    {
      imge: 'https://s6.uupload.ir/files/w-3_sol1.jpg',
      type: 'عمومی',
      field: 'بدنسازی',
      NameFamily: 'الیسا جعفری',
      Biography:
        'و به عنوان سرمربی تیم بانوان هیروفیت می‌توانم شما ورزشکاران گرامی را در رسیدن به اهداف تمرینی و تناسب اندام خود یاری نمایم. بنده مربی درجه یک و بین‌المللی رسمی فدراسیون بدنسازی و مربی بین‌المللی زومبا و همچنین تی‌ارایکس و پیلاتس هستم.اینجانب ۱۳ سال سابقه تمرینی و آموزشی دارم و در این مدت ورزشکاران زیادی را به اهداف تناسب اندام خود رسانده‌ام. امروز این امکان در هیروفیت فراهم آماده است تا در خدمت شما باشم و به رویای جمع بزرگتری از شما ورزشکاران عزیز جامع عمل بپوشانم.',
      id: '2',
    },
    {
      imge: 'https://s6.uupload.ir/files/w-4_b125.jpg',
      type: 'عمومی',
      field: 'بدنسازی',
      NameFamily: 'مهسا سلطانی',
      Biography:
        'و به عنوان سرمربی تیم بانوان هیروفیت می‌توانم شما ورزشکاران گرامی را در رسیدن به اهداف تمرینی و تناسب اندام خود یاری نمایم. بنده مربی درجه یک و بین‌المللی رسمی فدراسیون بدنسازی و مربی بین‌المللی زومبا و همچنین تی‌ارایکس و پیلاتس هستم.اینجانب ۱۳ سال سابقه تمرینی و آموزشی دارم و در این مدت ورزشکاران زیادی را به اهداف تناسب اندام خود رسانده‌ام. امروز این امکان در هیروفیت فراهم آماده است تا در خدمت شما باشم و به رویای جمع بزرگتری از شما ورزشکاران عزیز جامع عمل بپوشانم.',
      id: '3',
    },
    {
      imge: 'https://s6.uupload.ir/files/w-5_s29j.jpg',
      type: 'خصوصی',
      field: 'بدنسازی',
      NameFamily: 'فاطمه ابراهیمی',
      Biography:
        'و به عنوان سرمربی تیم بانوان هیروفیت می‌توانم شما ورزشکاران گرامی را در رسیدن به اهداف تمرینی و تناسب اندام خود یاری نمایم. بنده مربی درجه یک و بین‌المللی رسمی فدراسیون بدنسازی و مربی بین‌المللی زومبا و همچنین تی‌ارایکس و پیلاتس هستم.اینجانب ۱۳ سال سابقه تمرینی و آموزشی دارم و در این مدت ورزشکاران زیادی را به اهداف تناسب اندام خود رسانده‌ام. امروز این امکان در هیروفیت فراهم آماده است تا در خدمت شما باشم و به رویای جمع بزرگتری از شما ورزشکاران عزیز جامع عمل بپوشانم.',
      id: '4',
    },
    {
      imge: 'https://s6.uupload.ir/files/w-6_b4vr.jpg',
      type: 'خصوصی',
      field: 'بدنسازی',
      NameFamily: 'مریم حسینی',
      Biography:
        'و به عنوان سرمربی تیم بانوان هیروفیت می‌توانم شما ورزشکاران گرامی را در رسیدن به اهداف تمرینی و تناسب اندام خود یاری نمایم. بنده مربی درجه یک و بین‌المللی رسمی فدراسیون بدنسازی و مربی بین‌المللی زومبا و همچنین تی‌ارایکس و پیلاتس هستم.اینجانب ۱۳ سال سابقه تمرینی و آموزشی دارم و در این مدت ورزشکاران زیادی را به اهداف تناسب اندام خود رسانده‌ام. امروز این امکان در هیروفیت فراهم آماده است تا در خدمت شما باشم و به رویای جمع بزرگتری از شما ورزشکاران عزیز جامع عمل بپوشانم.',
      id: '5',
    },
    {
      imge: 'https://s6.uupload.ir/files/m-1_coqo.jpg',
      type: 'عمومی',
      field: 'بدنسازی',
      NameFamily: 'علی شریفی',
      Biography:
        'و به عنوان سرمربی تیم بانوان هیروفیت می‌توانم شما ورزشکاران گرامی را در رسیدن به اهداف تمرینی و تناسب اندام خود یاری نمایم. بنده مربی درجه یک و بین‌المللی رسمی فدراسیون بدنسازی و مربی بین‌المللی زومبا و همچنین تی‌ارایکس و پیلاتس هستم.اینجانب ۱۳ سال سابقه تمرینی و آموزشی دارم و در این مدت ورزشکاران زیادی را به اهداف تناسب اندام خود رسانده‌ام. امروز این امکان در هیروفیت فراهم آماده است تا در خدمت شما باشم و به رویای جمع بزرگتری از شما ورزشکاران عزیز جامع عمل بپوشانم.',
      id: '6',
    },
    {
      imge: 'https://s6.uupload.ir/files/m-2_rbj7.jpg',
      type: 'عمومی',
      field: 'بدنسازی',
      NameFamily: 'حسین محمودی',
      Biography:
        'و به عنوان سرمربی تیم بانوان هیروفیت می‌توانم شما ورزشکاران گرامی را در رسیدن به اهداف تمرینی و تناسب اندام خود یاری نمایم. بنده مربی درجه یک و بین‌المللی رسمی فدراسیون بدنسازی و مربی بین‌المللی زومبا و همچنین تی‌ارایکس و پیلاتس هستم.اینجانب ۱۳ سال سابقه تمرینی و آموزشی دارم و در این مدت ورزشکاران زیادی را به اهداف تناسب اندام خود رسانده‌ام. امروز این امکان در هیروفیت فراهم آماده است تا در خدمت شما باشم و به رویای جمع بزرگتری از شما ورزشکاران عزیز جامع عمل بپوشانم.',
      id: '7',
    },
    {
      imge: 'https://s6.uupload.ir/files/m-3_lr11.jpg',
      type: 'عمومی',
      field: 'بدنسازی',
      NameFamily: 'ماهان مهدوی',
      Biography:
        'و به عنوان سرمربی تیم بانوان هیروفیت می‌توانم شما ورزشکاران گرامی را در رسیدن به اهداف تمرینی و تناسب اندام خود یاری نمایم. بنده مربی درجه یک و بین‌المللی رسمی فدراسیون بدنسازی و مربی بین‌المللی زومبا و همچنین تی‌ارایکس و پیلاتس هستم.اینجانب ۱۳ سال سابقه تمرینی و آموزشی دارم و در این مدت ورزشکاران زیادی را به اهداف تناسب اندام خود رسانده‌ام. امروز این امکان در هیروفیت فراهم آماده است تا در خدمت شما باشم و به رویای جمع بزرگتری از شما ورزشکاران عزیز جامع عمل بپوشانم.',
      id: '8',
    },
    {
      imge: 'https://s6.uupload.ir/files/m-4_pwq3.jpg',
      type: 'خصوصی',
      field: 'بدنسازی',
      NameFamily: 'عادل احمدی',
      Biography:
        'و به عنوان سرمربی تیم بانوان هیروفیت می‌توانم شما ورزشکاران گرامی را در رسیدن به اهداف تمرینی و تناسب اندام خود یاری نمایم. بنده مربی درجه یک و بین‌المللی رسمی فدراسیون بدنسازی و مربی بین‌المللی زومبا و همچنین تی‌ارایکس و پیلاتس هستم.اینجانب ۱۳ سال سابقه تمرینی و آموزشی دارم و در این مدت ورزشکاران زیادی را به اهداف تناسب اندام خود رسانده‌ام. امروز این امکان در هیروفیت فراهم آماده است تا در خدمت شما باشم و به رویای جمع بزرگتری از شما ورزشکاران عزیز جامع عمل بپوشانم.',
      id: '9',
    },
    {
      imge: 'https://s6.uupload.ir/files/m-5_ner.png',
      type: 'خصوصی',
      field: 'بدنسازی',
      NameFamily: 'مهران صالحی',
      Biography:
        'و به عنوان سرمربی تیم بانوان هیروفیت می‌توانم شما ورزشکاران گرامی را در رسیدن به اهداف تمرینی و تناسب اندام خود یاری نمایم. بنده مربی درجه یک و بین‌المللی رسمی فدراسیون بدنسازی و مربی بین‌المللی زومبا و همچنین تی‌ارایکس و پیلاتس هستم.اینجانب ۱۳ سال سابقه تمرینی و آموزشی دارم و در این مدت ورزشکاران زیادی را به اهداف تناسب اندام خود رسانده‌ام. امروز این امکان در هیروفیت فراهم آماده است تا در خدمت شما باشم و به رویای جمع بزرگتری از شما ورزشکاران عزیز جامع عمل بپوشانم.',
      id: '10',
    },
    {
      imge: 'https://s6.uupload.ir/files/m-6_bi6p.jpg',
      type: 'خصوصی',
      field: 'بدنسازی',
      NameFamily: 'محمد ساسانی',
      Biography:
        'و به عنوان سرمربی تیم بانوان هیروفیت می‌توانم شما ورزشکاران گرامی را در رسیدن به اهداف تمرینی و تناسب اندام خود یاری نمایم. بنده مربی درجه یک و بین‌المللی رسمی فدراسیون بدنسازی و مربی بین‌المللی زومبا و همچنین تی‌ارایکس و پیلاتس هستم.اینجانب ۱۳ سال سابقه تمرینی و آموزشی دارم و در این مدت ورزشکاران زیادی را به اهداف تناسب اندام خود رسانده‌ام. امروز این امکان در هیروفیت فراهم آماده است تا در خدمت شما باشم و به رویای جمع بزرگتری از شما ورزشکاران عزیز جامع عمل بپوشانم.',
      id: '11',
    },
  ],
  days: [
    {
      time: '8.00am - 10.00am',
      type1: 'عمومی',
      NameFamily1: 'عاطفه فدایی',
      type2: 'خصوصی',
      NameFamily2: 'مریم حسینی',
      type3: 'عمومی',
      NameFamily3: 'الیسا جعفری',
      type4: 'خصوصی',
      NameFamily4: 'لیلا محمدی',
      type5: 'عمومی',
      NameFamily5: 'مهسا سلطانی',
      type6: 'خصوصی',
      NameFamily6: 'فاطمه ابراهیمی',
    },
    {
      time: '10.00am - 12.00am',
      type1: 'خصوصی',
      NameFamily1: 'لیلا محمدی',
      type2: 'عمومی',
      NameFamily2: 'مهسا سلطانی',
      type3: 'خصوصی',
      NameFamily3: 'فاطمه ابراهیمی',
      type4: 'عمومی',
      NameFamily4: 'عاطفه فدایی',
      type5: 'خصوصی',
      NameFamily5: 'مریم حسینی',
      type6: 'عمومی',
      NameFamily6: 'الیسا جعفری',
    },
    {
      time: '5.00pm - 7.00pm',
      type1: 'عمومی',
      NameFamily1: 'ماهان مهدوی',
      type2: 'خصوصی',
      NameFamily2: 'عادل احمدی',
      type3: 'عمومی',
      NameFamily3: 'علی شریفی',
      type4: 'خصوصی',
      NameFamily4: 'مهران صالحی',
      type5: 'عمومی',
      NameFamily5: 'حسین محمودی',
      type6: 'خصوصی',
      NameFamily6: 'محمد ساسانی',
    },
    {
      time: '7.00pm - 9.00pm',
      type1: 'خصوصی',
      NameFamily1: 'مهران صالحی',
      type2: 'عمومی',
      NameFamily2: 'ماهان مهدوری',
      type3: 'خصوصی',
      NameFamily3: 'محمد ساسانی',
      type4: 'عمومی',
      NameFamily4: 'علی شریفی',
      type5: 'خصوصی',
      NameFamily5: 'عادل احمدی',
      type6: 'عمومی',
      NameFamily6: 'حسین محمودی',
    },
  ],
  program: [
    {
      imge: 'https://gymfitclub.ir/public/images/articles/upload/barbell-bench-press.gif',
      title: 'پرس سینه هالتر :  ۱۰ × ۳',
    },
    {
      imge: 'https://gymfitclub.ir/public/images/articles/upload/incline-barbell-bench-press.gif',
      title: 'پرس بالا سینه : ۱۰ × ۳',
    },
    {
      imge: 'https://gymfitclub.ir/public/images/articles/upload/butterfly_maschine.gif',
      title: 'قفسه فلای : ۱۰ × ۳',
    },
    {
      imge: 'https://gymfitclub.ir/public/images/articles/upload/military-press.gif',
      title: 'سرشانه هالتر از جلو : ۱۰ × ۳',
    },
    {
      imge: 'https://gymfitclub.ir/public/images/articles/upload/wide-grip-lat-pulldown.gif',
      title: 'لت از جلو دست باز : ۱۰ × ۳',
    },
    {
      imge: 'https://gymfitclub.ir/public/images/articles/upload/cable-seated-row.gif',
      title: 'قایقی دستگاه : ۱۰ × ۳',
    },
    {
      imge: 'https://gymfitclub.ir/public/images/articles/upload/barbell-cheat-curl.gif',
      title: 'جلو بازو هالتر : ۱۰ × ۳',
    },
    {
      imge: 'https://gymfitclub.ir/public/images/articles/upload/cable-drag-curl.gif',
      title: 'جلو بازو سیم کش : ۱۰ × ۳',
    },
    {
      imge: 'https://gymfitclub.ir/public/images/articles/upload/straight-bar-tricep-pushdown.gif',
      title: 'پشت بازو سیم کش : ۱۰ × ۳',
    },

    {
      imge: 'https://gymfitclub.ir/public/images/articles/upload/leg-extension-machine-(1).gif',
      title: 'جلو پا دستگاه : ۱۰ × ۳',
    },
    {
      imge: 'https://gymfitclub.ir/public/images/articles/upload/lying-leg-curl.gif',
      title: 'پشت پا دستگاه : ۱۰ × ۳',
    },
    {
      imge: 'https://gymfitclub.ir/public/images/articles/upload/standing-calf-raise.gif',
      title: 'ساق پا دستگاه : ۱۵ × ۳',
    },
    {
      imge: 'https://gymfitclub.ir/public/images/articles/upload/knee-touch-crunch.gif',
      title: 'شکم : ۱۵ × ۳',
    },
    {
      imge: 'https://gymfitclub.ir/public/images/articles/upload/back-extension.gif',
      title: 'فیله کمر : ۱۵ × ۳',
    },
  ],
}

const getters = {
  GetTrainers(state) {
    return state.trainers
  },
  GetDays(state) {
    return state.days
  },
  GetProgram(state) {
    return state.program
  },
}
const mutations = {}
const actions = {}

export default {
  state,
  getters,
  mutations,
  actions,
}
